import fs from 'fs'
import fetch from 'node-fetch'
import {
    xpRange
} from '../lib/levelling.js'
const {
    levelling
} = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import {
    promises
} from 'fs'
import {
    join
} from 'path'
let handler = async (m, {
    conn,
    usedPrefix,
    usedPrefix: _p,
    __dirname,
    text,
    isPrems
}) => {
    try {
        let vn = './Menu.png'
        let pp = imagen4
        let img = await (await fetch('https://telegra.ph/.')).buffer()
        let d = new Date(new Date + 3600000)
        let locale = 'ar'
        let week = d.toLocaleDateString(locale, {
            weekday: 'long'
        })
        let date = d.toLocaleDateString(locale, {
            day: 'numeric',
            month: 'long',
            year: 'numeric'
        })
        let _uptime = process.uptime() * 1000
        let uptime = clockString(_uptime)
        let user = global.db.data.users[m.sender]
        let {
            money,
            joincount
        } = global.db.data.users[m.sender]
        let {
            exp,
            limit,
            level,
            role
        } = global.db.data.users[m.sender]
        let {
            min,
            xp,
            max
        } = xpRange(level, global.multiplier)
        let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length
        let more = String.fromCharCode(8206)
        let readMore = more.repeat(850)
        let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
        let str = `
⦓           ⦓🏆⦔          ⦔ـ
*☢︎︎☠︎︎📆تاريخ:* *${date}*
*☢︎︎☠︎︎🕛وقت نشط:* *${uptime}*
*☢︎︎☠︎︎⚡مستخدمين:* *${rtotalreg}*
*☢︎︎☠︎︎🎖️ مستوى* *${level}*
*☢︎︎☠︎︎🧰 خبرة* *${exp}*
*☢︎︎☠︎︎⚓ الدور* *${role}*
⦓           ⦓🏆⦔          ⦔ـ
*✍︎☢︎︎💎الماس:* *${limit}*
*✍︎☢︎︎👾عملات:* *${money}*
*✍︎☢︎︎🪙الرموز:* *${joincount}*
*✍︎☢︎︎🎟️مميز:* *${user.premiumTime > 0 ? '✅' : (isPrems ? '✅' : '❌') || ''}*
⦓           ⦓🏆⦔          ⦔ـ
*✆⏐اسـم البـوت⬷🎳𝙑𝙀𝙉𝙊𝙈*
*🐦‍⬛حط قبل اي امر (.)* 
*✆⏐بــوت ت ــابـع⬷🎄𝕭Ø𝕾𝕾* 
*✆⏐بــوت ت ــابـع⬷🎄MOAZZZ* 
*🌀المنصه Herko* 
*رابط جروب المطورين💦*
*https://chat.whatsapp.com/HEo159L6DVs4Yc3E8VuFox*
*🙈تفضل القائمة يا*  ${taguser}
⦓           ⦓🏆⦔          ⦔ـ
*❍➀⟣「اوامـــر الـــجـــروب」🥇* 
⦓           ⦓🏆⦔          ⦔ـ
*💌❯ ⏐ .ضيف* 
☫ ⌟يضيف شخص⌜
*💌❯ ⏐ .ابلاغ*
☫ ⌟ابلاغ المطور لو كان في عطل في البوت⌜
*💌❯ ⏐ .تـرقـيـه* 
☫ ⌟بيرفع عضو ادمن⌜
*💌❯ ⏐ .اعفاء*
☫ ⌟يعفي⌜
*💌❯ ⏐ .تحذير* 
☫ ⌟بيعطي للعضو تحذير⌜
*💌❯ ⏐ .حـذف_التحذير* 
☫ ⌟بيحذف التحذير⌜
*💌❯ ⏐ .حذف* 
☫ ⌟يحذف الرساله⌜
*💌❯ ⏐ .مـنـشـن* 
☫ ⌟يعمل منشن جماعي⌜
*💌❯ ⏐ .مخفي*
☫ ⌟يمنشن الناس الي مش بتتفاعل⌜
*💌❯ ⏐ .المشرفين*
☫ ⌟يمنشن للمشرفين⌜
*💌❯ ⏐ .مـنـشـن* 
☫ ⌟يعمل منشن جماعي⌜
*💌❯ ⏐ .بـروفـايـل* 
☫ ⌟يبعتلك قائمة بروفايلك⌜
*💌❯ ⏐ .الجروب*
☫ ⌟يجبلك وصف الجروب⌜
*💌❯ ⏐ .دعوه*
☫ ⌟يدعو شخص⌜
*💌❯ ⏐ .تغيير_اللينك*
☫ ⌟يرستر رابط الجروب⌜
*💌❯ ⏐ .لفل*
☫ ⌟يرفع مستواك⌜
*💌❯ ⏐ .جروب*  
☫ ⌟يجبلك وصف الجروب⌜
*💌❯ ⏐ .الترحيب* 
☫ ⌟البوت يرحب⌜
*💌❯ ⏐ .المغادره* 
☫ ⌟البوت يغادر الجروب⌜
*📿⇎.ايات* 
☫ ⌟اياات⌜
*💌❯ ⏐ .جـروب قفل____فتح*
☫ ⌟يقفل/يفتح شات الجروب⌜
*🌐↭.خط* 
☫ ⌟يزخرفلك الاسم⌜
*💌❯ ⏐ .توب*
☫ ⌟يعمل منشن ل 10 أعضاء⌜ 
*💌❯ ⏐ .لـيـنـك*
☫ ⌟بيبعت لينك الجروب⌜
*🪀⟲.يومي*
☫ ⌟بيديك يوميتك⌜
*🥵⟲.الماس* 
☫ ⌟بيديك الماس⌜
*💡⇄.ترتيب_البنك* 
☫ ⌟يرتبلك البنك⌜
*🎓⇄.شراء* 
☫ ⌟بتشتري من المتجر⌜
*🧛⟲.هجوم* 
☫ ⌟يهجم على الشخص اللي هتمنشن عليه⌜
*💌❯ ⏐ .منشنلي*
☫ ⌟البوت يمنشنلك⌜
*💌❯ ⏐ .شات*
☫ ⌟Chat gpt⌜
*💌❯ ⏐ .زخرفه*
☫ ⌟يزخرفلك الاسم⌜
⦓           ⦓🏆⦔          ⦔ـ
*❍➄⟣「قـــســـم الإســـلامـــي」🕌* 
⦓           ⦓🏆⦔          ⦔ـ
*🕋⇎.سورة*  
☫ ⌟يبعت سوره عشوائيه⌜
*🛐⇎.حديث*
☫ ⌟يبعت حديث عشوائي⌜
*☪️⇎.قران* 
☫ ⌟بيجبلك قران⌜
*🤲⇎.الله* 
☫ ⌟ادعيه دينيه⌜
⦓           ⦓🏆⦔          ⦔ـ
*❍⑨⟣「قـــســـم الـــمـــطـــور*🪷
⦓           ⦓🏆⦔          ⦔ـ
*👑❯ ⏐ .ضيف_بريميام* 
☫ ⌟يخلي مميز في البوت⌜
*👑❯ ⏐ .حذف_بريميام* 
☫ ⌟يشيل البريم⌜
*👑❯ ⏐ .بان* 
☫ ⌟يمنعهم من استخدام البوت⌜
*👑❯ ⏐ .الغاء_البان* 
☫ ⌟يفك البان من البوت⌜
*👑❯ ⏐.اطفاء* 
☫ ⌟يقفل البوت ⌜
*🗻✒.تفعيل* 
☫ ⌟يفتح البوت⌜
*👑❯ ⏐ .المبندين* 
☫ ⌟يبعتلك قائمة اللي واخدين بان⌜
*🎡✒.إعادة* 
☫ ⌟اعادة تشغيل البوت⌜
*👑❯ ⏐.اعادةتشغيل* 
☫ ⌟يعيد تشغيل البوت⌜
*👑❯ ⏐ .أدخل*
☫ ⌟يدخل البوت الجروب⌜
*👑❯ ⏐ .ضيف_اكس_بي* 
☫ ⌟يضيف للمستخدمين اكسبي⌜
*👑❯ ⏐ .ضيف_جواهر* 
☫ ⌟يضيف للمستخدمين جواهر⌜
*👑❯ ⏐ .الجروبات* 
☫ ⌟قائمة الجروبات اللي البوت داخلها⌜
⦓           ⦓🏆⦔          ⦔ـ
*❍➁⟣「قـــســـم تـــحـــمـــيـــل」📂* 
⦓           ⦓🏆⦔          ⦔ـ
*🕶️⟐.انستغرام*  
☫ ⌟يجبلك من انستغرام⌜
*🎭⟐.انستا* 
☫ ⌟يجبلك من الانستا⌜
*🥁⟐.تيكتوك* 
☫ ⌟يحبلك من تيك⌜
*🧬⟐.تويتر* 
☫ ⌟يجبلك من تويت⌜
*🎵⟐.اغنية* 
☫ ⌟يشغلك اغنيه⌜
*🔍⟐.بحث* 
☫ ⌟بيبحثلك⌜
*📺⟐.فيديو* 
☫ ⌟بيشغلك فيد⌜
*🧢⟐.تطبيق* 
☫ ⌟بيحملك تطبيق⌜
*🖼️⟐.صوره*
☫ ⌟بيجبلك صوره من الجوجل⌜
⦓           ⦓🏆⦔          ⦔ـ
*❍➃⟣「قـــســـم الـــتـــرفـــيـــه」🎑* 
⦓           ⦓🏆⦔          ⦔ـ
*🕹️❯ ⏐ .اكس او* 
☫ ⌟لعبة اكس او مع صديقك⌜
*💱⇙.كت* 
☫ ⌟اللي هيكتب الاسم الاول⌜
*🛡️⇙.صراحه* 
☫ ⌟لعبة صراحه⌜
*🕹️❯ ⏐ .لو* 
☫ ⌟لو خيروك⌜
*🕹️❯ ⏐ .هل* 
☫ ⌟تسال البوت و هوا يجاوب⌜
*📋↭.ترجم* 
☫ ⌟يترجملك الكلمه⌜
*🕹️❯ ⏐ .احزر*
☫ ⌟احزر الشخصية من الصوره⌜
*🫂🕹️❯ ⏐ .زواج* 
☫ ⌟يجوز اتنين في الجروب 🤣⌜
*📍❯ ⏐ .انـطـق* 
☫ ⌟لتحويل النص الي صوت⌜
*🎍⇙.تاج* 
☫ ⌟افهمها انت⌜
*🖍️⇙.حكمه* 
☫ ⌟البوت يجبلك حكمه⌜
*🗣️⇙.ميمز* 
☫ ⌟ميمز انمي⌜
*♎⇙.سؤال* 
☫ ⌟سؤال من عالم انمي⌜
*👀↭.اسال* 
☫ ⌟البوت بيسألك ⌜
*📋↭.ايديت* 
☫ ⌟ايديت انمي ⌜
*👁️↭.عين* 
⦓           ⦓🏆⦔          ⦔ـ
*❍➂⟣「قــســم الــتــحــويــلات」🪔*  
⦓           ⦓🏆⦔          ⦔ـ
*💌↭.ملصق* 
☫ ⌟لتحويل الفيديو او الصوره لملصق متحرك⌜
*👀↭.سرقه* 
☫ ⌟يغير حقوق الملصقات⌜
*🌙↭.لفيديو* 
☫ ⌟يحول الملصق لفيديو⌜
*🌬️↭.لصورة* 
☫ ⌟يحول الملصق لصوره⌜
*🥋↭.لانمي* 
☫ ⌟يحول الصوره لانمي⌜
*💽↭.تخيل* 
☫ ⌟البوت يتخيل صوره⌜
*🕯️↭.مكس*
☫ ⌟يدمج اتنين من الايمواجي⌜
*📦↭.لجواهر* 
☫ ⌟يحولك لجواهر⌜
*📲↭.ستك* 
☫ ⌟*+*⌜
*🎗️↭.تلجراف* 
☫ ⌟لتحويل الاشياء الي تليجراف⌜
*🪅↭.لكرتون* 
☫ ⌟يحول الصوره لكرتون⌜
*🎃↭.باركود* 
☫ ⌟تحويل النص لباركود⌜
⦓           ⦓🏆⦔          ⦔ـ
*❍⑧⟣「قــســم تــحــويــل ريـــك」🔊* 
⦓           ⦓🏆⦔          ⦔ـ
*🔋⤺.عميق* 
☫ ⌟يخلي الريك عميق ⌜
*🎤⤺.منفوخ* 
☫ ⌟يخلي الصوت منفوخ ⌜
*🚨⤺.تخين* 
☫ ⌟يخلي الصوت تخين ⌜
*🥌⤺.صاخب* 
☫ ⌟يخلي الصوت صاحب ⌜
*🎳⤺.سريع* 
☫ ⌟يخلي الصوت سريع ⌜
*🪫⤺.تخينن* 
☫ ⌟يخلي الصوت تخين جداً⌜ 
*🪘⤺.رفيع* 
☫ ⌟يخلي الصوت رفيع ⌜
*🤖 ⤺.روبوت* 
☫ ⌟يخلي الصوت روبوت ⌜
*🍃⤺.بطئ* 
☫ ⌟يخلي الصوت بطئ ⌜
*🥯⤺.ناعم* 
☫ ⌟يخلي الصوت ناعم ⌜
*🐿️⤺.سنجاب* 
☫ ⌟يخلي الصوت مسنجب ⌜
⦓           ⦓🏆⦔          ⦔ـ
👑┑━━━حـقـوق الـمـطـور━━━┍👑
⦓           ⦓🏆⦔          ⦔ـ
*❗⇆ رقـم الـمطـور  ↯*
❗ده  https://wa.me/+201024480189
*❗⇆ رقـم الـمطـور  ↯*
❗ده  https://wa.me/+201024480189
👑┙━━━حـقـوق الـمـطـور━━━┕👑
`.trim()
        const _0x3c7cab = _0x5a1d;

        function _0x5a1d(_0x1b92fa, _0x42ca62) {
            const _0x5a1d39 = _0x42ca();
            _0x5a1d = function (_0x28d0f5, _0x342e36) {
                _0x28d0f5 = _0x28d0f5 - 0x0;
                let _0x4abc25 = _0x5a1d39[_0x28d0f5];
                return _0x4abc25;
            };
            return _0x5a1d(_0x1b92fa, _0x42ca62);
        }

        function _0x42ca() {
            const _0xe1e20e = ['2409147cMTtvV', '70SxKSwY', 'trim', '2708027tOnEUS', '831853GQAjyu', '6ZrUjVF', '𝐓𝐄𝐌𝐏𝐄𝐒𝐓 𝗠𝗗 💌', '406070MLYaeB', 'https://chat.whatsapp.com/EW7a27PboPy9Adxh23RNMa', '4YbGMkZ', '840496IPJeXP', '322835aPaRGc', 'VIDEO', '3639410cLSfPv', 'sender', '9LtUyCF'];
            _0x42ca = function () {
                return _0xe1e20e;
            };
            return _0x42ca();
        }(function (_0x2979d9, _0x233f8f) {
            const _0x32315e = _0x5a1d;
            const _0x3b1890 = _0x2979d9();
            while (!![]) {
                try {
                    const _0x2cc4d6 = parseInt(_0x32315e(0x5)) / 0x1 + parseInt(_0x32315e(0x1)) / 0x2 + -parseInt(_0x32315e(0xa)) / 0x3 * (parseInt(_0x32315e(0x3)) / 0x4) + parseInt(_0x32315e(0x7)) / 0x5 + -parseInt(_0x32315e(0xf)) / 0x6 * (parseInt(_0x32315e(0xd)) / 0x7) + parseInt(_0x32315e(0x4)) / 0x8 * (-parseInt(_0x32315e(0x9)) / 0x9) + -parseInt(_0x32315e(0xb)) / 0xa * (-parseInt(_0x32315e(0xe)) / 0xb);
                    if (_0x2cc4d6 === _0x233f8f) {
                        break;
                    } else {
                        _0x3b1890['push'](_0x3b1890['shift']());
                    }
                } catch (_0x3284ad) {
                    _0x3b1890['push'](_0x3b1890['shift']());
                }
            }
        }(_0x42ca, 0x772cd));
        let buttonMessage = {
            'image': pp,
            'caption': str[_0x3c7cab(0xc)](),
            'mentions': [m[_0x3c7cab(0x8)]],
            'footer': '' + wm,
            'headerType': 0x4,
            'contextInfo': {
                'mentionedJid': [m['sender']],
                'externalAdReply': {
                    'showAdAttribution': !![],
                    'mediaType': _0x3c7cab(0x6),
                    'mediaUrl': null,
                    'title': _0x3c7cab(0x0),
                    'body': null,
                    'thumbnail': img,
                    'sourceUrl': _0x3c7cab(0x2)
                }
            }
        };
        conn.sendMessage(m.chat, buttonMessage, {
            quoted: m
        })

    } catch {
        conn.reply(m.chat, '[❗خطاء❗]', m)
    }
}
handler.command = /^(help|الاوامر|menu|أوامر|menu|اوامر)$/i
handler.exp = 20
handler.fail = null
export default handler

function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')
    }
